---
kind: type
id: T:Autodesk.Revit.DB.CurveElement
source: html/61673852-2d08-003d-e9fd-4be89d533774.htm
---
# Autodesk.Revit.DB.CurveElement

Class representing curve elements.

## Syntax (C#)
```csharp
public class CurveElement : Element
```

## Remarks
As a base class of several specialized curved elements
 (such as ModelCurve, ModelLine, CurveByPoints, etc.)
 CurveElement exposes methods and properties of general use
 applicable to most kinds of curves.